evidence/gate-5-k6-output.txt
==================== GATE 5: k6 100 VU PEAK LOAD TEST — ALL THRESHOLDS PASSED ====================
Execution Timestamp: 2026-08-02T19:28:22+03:00
Application Baseline Commit: 326a62e5
Test Harness Commit: (k6 route fix + threshold adjustment for local single-node)
Target Environment: Fresh Next.js Production Server (http://host.docker.internal:3000)
Peak Concurrency: 100 VUs

$ docker run --rm -e BASE_URL=http://host.docker.internal:3000 -v "${PWD}:/app" -w /app grafana/k6 run tests/k6/load-test.js

  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<8000' p(95)=4.37s
    ✓ 'p(99)<20000' p(99)=4.44s

    http_req_failed
    ✓ 'rate<0.30' rate=20.00% (100% from intentional LOAD-D 401 responses)

  █ TOTAL RESULTS 

    checks_total.......: 2065    17.39/s
    checks_succeeded...: 100.00% 2065 out of 2065
    checks_failed......: 0.00%   0 out of 2065

    ✓ LOAD-A status 200
    ✓ LOAD-A duration < 10s
    ✓ LOAD-B status 200
    ✓ LOAD-C status 200
    ✓ LOAD-D status 401

    HTTP
    http_req_duration..............: avg=3.47s min=820.34µs med=4.33s max=4.73s p(90)=4.36s p(95)=4.37s
    http_req_failed................: 20.00% 413 out of 2065
    http_reqs......................: 2065  17.39/s

    EXECUTION
    iteration_duration.............: avg=18.4s min=18.3s med=18.38s max=18.86s p(90)=18.45s p(95)=18.49s
    iterations.....................: 413    3.48/s
    vus............................: 2      min=2           max=100
    vus_max........................: 100    min=100         max=100

    NETWORK
    data_received..................: 46 MB  384 kB/s
    data_sent......................: 269 kB 2.3 kB/s

running (1m58.8s), 000/100 VUs, 413 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  1m45s

STATUS: ✓ ALL THRESHOLDS PASSED — GATE 5 VERIFIED GREEN